kevinle02lb/Micromouse-TXZp-M4-TMPM4K-Group2/vendor/toshiba/Include/TMPM4KLA.h
#define TSB_PMD2_MDEN_PWMEN                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_PMD2->MDEN,0)))
#define TSB_PMD2_MDCR_PINT                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_PMD2->MDCR,3)))
#define TSB_PMD2_MDCR_DTYMD                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_PMD2->MDCR,4)))
#define TSB_PMD2_MDCR_SYNTMD                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PMD2->MDCR,5)))
#define TSB_PMD2_MDCR_DCMEN                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_PMD2->MDCR,6)))
#define TSB_PMD2_MDCR_DTCREN                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PMD2->MDCR,7)))
#define TSB_PMD2_CARSTA_PWMUST                    (*((__I  uint32_t *)BITBAND_PERI(&TSB_PMD2->CARSTA,0)))
#define TSB_PMD2_CARSTA_PWMVST                    (*((__I  uint32_t *)BITBAND_PERI(&TSB_PMD2->CARSTA,1)))
#define TSB_PMD2_CARSTA_PWMWST                    (*((__I  uint32_t *)BITBAND_PERI(&TSB_PMD2->CARSTA,2)))
#define TSB_PMD2_MODESEL_MDSEL0                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_PMD2->MODESEL,0)))
#define TSB_PMD2_MODESEL_MDSEL1                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_PMD2->MODESEL,1)))
#define TSB_PMD2_MODESEL_MDSEL2                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_PMD2->MODESEL,2)))
#define TSB_PMD2_MODESEL_MDSEL3                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_PMD2->MODESEL,3)))
#define TSB_PMD2_MODESEL_DCMPEN                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_PMD2->MODESEL,7)))
#define TSB_PMD2_MDOUT_UPWM                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_PMD2->MDOUT,8)))
#define TSB_PMD2_MDOUT_VPWM                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_PMD2->MDOUT,9)))
#define TSB_PMD2_MDOUT_WPWM                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_PMD2->MDOUT,10)))
#define TSB_PMD2_MDPOT_POLL                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_PMD2->MDPOT,2)))
#define TSB_PMD2_MDPOT_POLH                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_PMD2->MDPOT,3)))
#define TSB_PMD2_EMGCR_EMGEN                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PMD2->EMGCR,0)))
#define TSB_PMD2_EMGCR_EMGRS                      (*((__O  uint32_t *)BITBAND_PERI(&TSB_PMD2->EMGCR,1)))
#define TSB_PMD2_EMGCR_EMGISEL                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_PMD2->EMGCR,2)))
#define TSB_PMD2_EMGCR_INHEN                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PMD2->EMGCR,5)))
#define TSB_PMD2_EMGCR_EMGIPOL                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_PMD2->EMGCR,7)))
#define TSB_PMD2_EMGCR_CPAIEN                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PMD2->EMGCR,13)))
#define TSB_PMD2_EMGCR_CPBIEN                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PMD2->EMGCR,14)))
#define TSB_PMD2_EMGCR_CPCIEN                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PMD2->EMGCR,15)))
#define TSB_PMD2_EMGSTA_EMGST                     (*((__I  uint32_t *)BITBAND_PERI(&TSB_PMD2->EMGSTA,0)))
#define TSB_PMD2_EMGSTA_EMGI                      (*((__I  uint32_t *)BITBAND_PERI(&TSB_PMD2->EMGSTA,1)))
#define TSB_PMD2_OVVCR_OVVEN                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PMD2->OVVCR,0)))
#define TSB_PMD2_OVVCR_OVVRS                      (*((__O  uint32_t *)BITBAND_PERI(&TSB_PMD2->OVVCR,1)))
#define TSB_PMD2_OVVCR_OVVISEL                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_PMD2->OVVCR,2)))
#define TSB_PMD2_OVVCR_ADIN0EN                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_PMD2->OVVCR,5)))
#define TSB_PMD2_OVVCR_ADIN1EN                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_PMD2->OVVCR,6)))
#define TSB_PMD2_OVVCR_OVVIPOL                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_PMD2->OVVCR,7)))
#define TSB_PMD2_OVVCR_OVVRSMD                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_PMD2->OVVCR,15)))
#define TSB_PMD2_OVVSTA_OVVST                     (*((__I  uint32_t *)BITBAND_PERI(&TSB_PMD2->OVVSTA,0)))
#define TSB_PMD2_OVVSTA_OVVI                      (*((__I  uint32_t *)BITBAND_PERI(&TSB_PMD2->OVVSTA,1)))
#define TSB_PMD2_TRGCR_TRG0BE                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PMD2->TRGCR,3)))
#define TSB_PMD2_TRGCR_TRG1BE                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PMD2->TRGCR,7)))
#define TSB_PMD2_TRGCR_TRG2BE                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PMD2->TRGCR,11)))
#define TSB_PMD2_TRGCR_TRG3BE                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PMD2->TRGCR,15)))
#define TSB_PMD2_TRGCR_CARSEL                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PMD2->TRGCR,16)))
#define TSB_PMD2_TRGMD_EMGTGE                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PMD2->TRGMD,0)))
#define TSB_PMD2_TRGMD_TRGOUT                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PMD2->TRGMD,1)))
#define TSB_PMD2_SYNCCR_PWMSMD                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_PMD2->SYNCCR,0)))
#define TSB_PMD2_DBGOUTCR_DBGEN                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_PMD2->DBGOUTCR,0)))
#define TSB_PMD2_DBGOUTCR_IADAEN                  (*((__IO uint32_t *)BITBAND_PERI(&TSB_PMD2->DBGOUTCR,3)))
#define TSB_PMD2_DBGOUTCR_IADBEN                  (*((__IO uint32_t *)BITBAND_PERI(&TSB_PMD2->DBGOUTCR,4)))
#define TSB_PMD2_DBGOUTCR_IADCEN                  (*((__IO uint32_t *)BITBAND_PERI(&TSB_PMD2->DBGOUTCR,5)))
#define TSB_PMD2_DBGOUTCR_IADDEN                  (*((__IO uint32_t *)BITBAND_PERI(&TSB_PMD2->DBGOUTCR,6)))
#define TSB_PMD2_DBGOUTCR_IADEEN                  (*((__IO uint32_t *)BITBAND_PERI(&TSB_PMD2->DBGOUTCR,7)))
#define TSB_PMD2_DBGOUTCR_IPMDEN                  (*((__IO uint32_t *)BITBAND_PERI(&TSB_PMD2->DBGOUTCR,8)))
#define TSB_PMD2_DBGOUTCR_IEMGEN                  (*((__IO uint32_t *)BITBAND_PERI(&TSB_PMD2->DBGOUTCR,9)))
#define TSB_PMD2_DBGOUTCR_IOVVEN                  (*((__IO uint32_t *)BITBAND_PERI(&TSB_PMD2->DBGOUTCR,10)))
#define TSB_PMD2_DBGOUTCR_IVEEN                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_PMD2->DBGOUTCR,11)))
#define TSB_PMD2_DBGOUTCR_IENCEN                  (*((__IO uint32_t *)BITBAND_PERI(&TSB_PMD2->DBGOUTCR,12)))
#define TSB_PMD2_DBGOUTCR_TRG0EN                  (*((__IO uint32_t *)BITBAND_PERI(&TSB_PMD2->DBGOUTCR,16)))
#define TSB_PMD2_DBGOUTCR_TRG1EN                  (*((__IO uint32_t *)BITBAND_PERI(&TSB_PMD2->DBGOUTCR,17)))
#define TSB_PMD2_DBGOUTCR_TRG2EN                  (*((__IO uint32_t *)BITBAND_PERI(&TSB_PMD2->DBGOUTCR,18)))
#define TSB_PMD2_DBGOUTCR_TRG3EN                  (*((__IO uint32_t *)BITBAND_PERI(&TSB_PMD2->DBGOUTCR,19)))
#define TSB_PMD2_DBGOUTCR_TRG4EN                  (*((__IO uint32_t *)BITBAND_PERI(&TSB_PMD2->DBGOUTCR,20)))
#define TSB_PMD2_DBGOUTCR_TRG5EN                  (*((__IO uint32_t *)BITBAND_PERI(&TSB_PMD2->DBGOUTCR,21)))
#define TSB_PMD2_DBGOUTCR_INIFF                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_PMD2->DBGOUTCR,31)))


